{
    "article no" : ,
    "title": " ", 
    "date" : "", 
    "intent" : " A person is said to be arrested when a police officer or a citizen takes him into custody 
    or otherwise substantially deprives him of his freedom of action so that he may be held to 
    answer for a crime or an offence. 
     The police in India do not have any power to detain anybody for questioning unless he is arrested with or without warrant. 
     The most basic provision relating to arrest has been incorporated in the Article 21 of the 
    Constitution. It lays down that no persons can be deprived of his/her right to liberty, 
    except in accordance with the procedure established by law. 
     Article 22-(1) of the constitution provides, “no persons who is arrested shall be detained 
    in custody without being informed, as soon as maybe, of the grounds for such arrest nor 
    shall he be denied the right to consult, and to be defended by a legal practitioner of his choice.”",
    "rule" : [
        {
            "RIGHT OF ARRESTED WOMEN:
             Every woman must be aware of some basic rights relating to arrest to ensure her well being while she is in custody. 
                    1) She must be informed about the grounds for her arrest and full particulars of 
                    charges levied on her for that matter of fact. 
                    2) She has right to see the warrant if arrested under warrant (Sec.75 CrPC) 
                    3) She has the right to privacy while recording statement. 
                    4) She has the right to consult the legal practitioner of her choice and to be defended 
                    by him. 
                    5) The accused must be produced before the magistrate within 24 hours of arrest. 
                    6) It is the right of the arrestee to inform of her arrest to either her relatives or to her 
                    friends. 
                    7) A woman cannot be arrested before sunrise or after sunset except with the prior 
                    permission of a magistrate. 
                    8) A woman can only be taken into custody in presence of a woman police officer as 
                    far as practicable and the arrest must be affected with proper dignity. 
                    9) No beatings or force can be administered while arresting a female accused. 
                    10) The search examination of the female prisoners shall be carried out by the matron 
                    under the general or the special order of the medical officer. 
                    11) The female prisoners have the right to live separately from the male prisoners. 
                    12) All the prisoners have the basic human rights such as hygienic food, shelter, 
                    medical facilities and facilities of reading and writing. 
                    13) If arrested soon after a child birth women cannot be taken before the magistrate 
                    until they are in proper conditions to travel. 
                    14) Women prisoners have the right to speedy trial. 
                    15) Examination of body of an arrested person by a registered medical practioner at 
                    the request of the arrested person in case of torture and maltreatment in the lock 
                    ups. 
                    16) The legal assistance to a poor or indigent accused, arrested and put in jeopardy of 
                    life or personal liberty, is a Constitutional imperative mandated not only by 
                    Article 39-A but also by Articles 14 and 21 of the constitution. 
                    17) Rights of the pregnant women in jails (pre-natal and post-natal care, 
                    Gynecological examination etc.) "
        },
        {
            "ARREST WARRANT 
             It is a written order issued by a court to a police officer to arrest and produce an offender 
            or to search his premises for a particular thing. 
             A police officer who executes the warrant shall notify the substance thereof to the person 
            to be arrested and if he demands, shall show him the warrant. 
             He is expected to bring the required person before the court without unnecessary delay. 
             A warrant of arrest should be in writing, signed by the presiding officer of the court and 
            should bear the seal of the court. 
             It should also contain the name of the accused, his address and indicate the offence for 
            which he is charged. 
             If any of these factors is absent, the warrant is not in order and arrest made in execution 
            of such warrant is illegal. 
             Warrants are of two kinds: 
             Bailable and 
             Non-bailable "
        },
        {
            "ARREST WITHOUT WARRANT:
             A police officer has power to arrest a person without warrant if he is suspected of having committed a cognizable offence. 
             Normally in non-cognizable offences a police officer cannot arrest a person without a warrant from magistrate. 
             In the first schedule of the Criminal Procedure Code (CrPC) offences have been 
            classified and enumerated as cognizable and non-cognizable. The more serious offences 
            such as murder, rape, robbery, theft, and waging war against the state etc. are cognizable."
        },
        {
            "When can a person be arrested without a warrant? 
            o If he is involved in a cognizable offence or if there ia a reasonable suspicion, complaint or information that he has committed a cognizable offence; 
            o If he possesses implements of house breaking; 
            o If he possesses stolen property; 
            o If he is an proclaimed offender; 
            o If he obstructs a police officer on duty; 
            o If he escapes from a legal custody; 
            o If he is a deserter from the army, navy or air force; 
            o Where he is out of India, if he commits an offence punishable under any extradition; 
            o Under the fugitive Offenders Act; 
            o If he is a released convict who breaks the restrictions imposed by the court on his movements; 
            o If he is suspected of preparing to commit a cognizable offence; 
            o if he is a habitual criminal; 
            o If he, after committing a non-cognizable offence in the presence of a police officer, 
            refuses to give the police his name and address or has given him a false name and address; 
            o If he is required by a police officer of another police station who suspects that he has 
            committed a cognizable offence;"
        },
        {
            "BAILABLE/ NON-BAILABLE OFFENCES
             BAILABLE OFFENCES
             when any person accused for a bailable offence is arrested or detained without warrant by 
            an officer in charge of a police station, or appears or is brought before a court, and is 
            prepared at any time while in custody of such officer or at any stage of the proceedings 
            before such court to give bail, such person shall be released on bail. 
             In case of a bailable offence bail is a matter of right. 
             If such officer or court, thinks it fit such person maybe released on a personal bond 
            without sureties. 
             In case of bailable offence, one has to only file the bail bonds and no application is required. 
             NON-BAILABLE OFFENCES 
             When any person accused for a non-bailable offence is arrested or detained without 
            warrant by an officer in charge of a police station, it is a matter of discretion of the court to grant or refuse bail. 
             On appearance the arrested person is brought before a court other than the High Court or 
            Court of Session, he may be released on bail on the direction of Court if such a person is: 
            o Under the age of sixteen years or is a woman or is sick or infirm and gives an 
            undertaking that he shall comply with such directions as he may be given by the Court. 
            o And shall not be released if there appear reasonable grounds for believing that he 
            has been guilty of an offence punishable with death or imprisonment for life; 
            o And shall not be released if such offence is Cognizable Offence and he had been 
            previously convicted of an offence punishable with death or imprisonment for life 
            or imprisonment for seven years or more, or he has been previously convicted on 
            two or more occasions of a non-bailable and cognizable offence. 
             When a person accused or suspected of the commission of an offence punishable with 
            imprisonment which may extend to seven years or more or of an offence or abetment of, 
            or conspiracy or attempt to commit, any such offence, is released on bail, the court may 
            impose any condition which the court considers necessary in order to ensure that such 
            person shall attend in accordance with the conditions of the bond executed under this 
            Chapter or in order to ensure that such person shall not commit an offence similar to the 
            offence of which he is accused or of the commission of which he is suspected, or otherwise in the interests of justice. 
             An officer or a court releasing any person on bail shall record in writing the reasons for doing so. "
        }
    ] ,
    "penalty" : [
        {

        }
    ]
}