{
    "article no" : ,
    "title": " ", 
    "date" : "", 
    "intent" : "",
    "rule" : [
        {
            "- Act was passed in 2005 and was implemented from October, 2006. 
            - The Act broadens the definition of Domestic Violence is under Section 3 of the Act cover the following kinds of abuses; 
            -Physical abuse, 
            - Sexual abuse 
            -Verbal and emotional abuse and 
            -Economic abuse 
- The Act broadens the definition of domestic relationships by including mothers, wives, sister-in-laws, daughters, and daughter-in-laws. 
Beneficiaries under the Act are: Women, Children and Respondent. 
- PWDVA recognizes a life free of violence and fear and makes the state responsible for extending protection against domestic violence to women.  
- PWDVA seeks to protect women from all forms of domestic violence and check harassment and exploitation by family members or relatives. 
- The first and immediate consequence, if a woman files complaints against DV is dispossession-through the woman out of the house and taking custody of children. 
- PWDVA empowers a woman to claim immediate maintenance and compensation. 
- Right granted to women under the domestic violence Act: 
> Right to reside in a shared household 
> Right to issuance of Orders 
> Protection Orders 
> Residence Orders 
> Monetary relief 
> Custody orders 
> Compensation orders 
> Interim and Ex parte Orders 
> Right to obtain relief granted by other suits and legal proceedings."
        }
    ] ,
    "penalty" : [
        {
            "LIABILITIES AND RESTRICTIONS IMPOSED UPON THE RESPONDENT:
- He can be subjected to certain restrictions as contained in the Protection and Residence order issued against him. 
- The respondent can be made accountable for providing monetary relief to the aggrieved person and her children and pay compensation damages as directed in the Compensation order. 
- He has to follow the arrangement\s made by the court regarding the custody of the child or children of the aggrieved person as specified in the Custody order. 
- The Act does not permit any female relative of the husband or male partner to file a complaint against the wife or female partner."
        },
        {
            "PROCEDURE OF FILING COMPLAINT AND THE COURT’S DUTY (SECTIONS 12-29)
- The aggrieved person or any other witness of the offence can approach a Police officer, Protection Officers or Service Provider or Magistrate. 
- The Magistrate shall give a notice of the date of hearing to the Protection officers within a maximum period of 2 days or such further reasonable time as allowed by the Magistrate. 
- The court is required to dispose of the case within 60 days of the first hearing.
- Upon finding the complaint to be genuine, the Magistrate may, direct the respondent or the aggrieved person, either singly or jointly, to undergo counseling. 
- Direct that the women shall not be evicted or excluded from the household or any part of it. 
- Pass a protection order, providing protection to the women which shall remain in force till the aggrieved person applies for discharge. 
- Grant monetary relief to meet the expenses incurred and losses suffered by the aggrieved person and any child of the aggrieved person due to domestic violence. 
- Grant custody orders of any child or children of aggrieved person. 
- Compensation/damages for the injuries including mental torture and emotional distress caused by domestic violence. If upon receipt of an application from the aggrieved person, the Magistrate is satisfied that the circumstances so require, he may alter, modify or revoke an order after recording the reasons in writing. 
- A complaint can also be filed under Section 498-A of the Indian Penal Code."
        }
    ]
}