{
    "article no" : ,
    "title": " ", 
    "date" : "", 
    "intent" : "",
    "rule" : [
        {
            " The Family Courts Act, 1948 was passed to facilitate satisfactory resolution of disputes 
            concerning the family through a forum expected to work expeditiously in a just manner and 
            with an approach to ensure maximum welfare of society and dignity of women. 
             There are cases dealing with broad spectrum of issues such as family matters and property 
            which continue for generations (ranging fromm7 years to 30 years).
             In such a scenario, the channeling of cases to different courts set up specifically for this 
            purpose not only ensures their speedy disposal, but also ensures that the cases, being dealt 
            with experts in courts specifically set up for this purpose are dealt with, more effectively. 
             The aim of the family courts is to form a congenial atmosphere where family disputes are 
            resolved amicably. 
             There are issues like alimony which became the topic of great controversy and cause great 
            harassment to families. 
             The main purpose behind setting up these courts was to take the cases dealing with family 
            matters away from intimidating atmosphere of regular courts and ensure that a congenial 
            environment is set up to deal with matters such as marriage, divorce, alimony, child custody 
            etc. 
             The family courts are equipped with counselors and physiologists who ensure that the 
            disputes are handled by experts. 
             The role of the counselors is not limited to counseling but extends to reconciliation and 
            mutual settlement wherever deemed feasible. "
        },
    ] ,
    "penalty" : [
        {
            "PROCEDURE FOLLOWED BY THE FAMILY COURTS
            - The Family Courts are free to evolve their own rules and procedure, and once a 
            Family Court does so, the rules so framed override the rules of procedure 
            contemplated under the Code of Civil Procedure.
            - Special emphasis is put on settling the disputes by mediation and conciliation and to 
            give priority to mutual agreement over the usual process of adjudication. 
            - The most unique aspect regarding the proceedings before the Family Court are that 
            they are first referred to conciliation and only when the conciliation proceedings fail 
            to resolve the issue successfully, the matter is taken up for trial by the court. 
            - The cases are kept away from the trappings of a formal legal system. 
            - The Act stipulates that a party is not entitled to be represented by a lawyer without the 
            express permission of the court. "
        }
    ]
}