{
    "article no" : ,
    "title": " ", 
    "date" : "", 
    "intent" : "",
    "rule" : [
        {
            "FREE LEGAL AID AND SERVICES:
             Article 39-A of the Constitution of India provides for free legal Aid for the poor and 
            weaker sections of the society to ensure justice thereof. 
             In the year 1987, the Legal Services Authority Act was enacted by the Parliament (that 
            came into force on 9th November, 1995) with an objective to establish a nationwide 
            uniform network for providing free and competent legal services to the weaker sections 
            of the society on the basis of equal opportunities.
             Article 14 of the Indian Constitution makes it obligatory for the state to ensure equality 
            before the law and provide for a legal system which promotes justice on the basis of equal opportunities to all. 
             The National Legal Services Authority (NALSA) has been constituted under the Legal 
            Services Authority Act, 1987 to monitor and evaluate the implementation of legal services under the Act. 
             The Chief Justice of India is the Patron-in-Chief of NALSA. 
             In every State, a Legal Services Authority and in every High Court Legal Services Committee has been constituted. 
             Further, at each District Level, District Legal Services Authority and Taluka Legal 
            Services Committees have been constituted to give effect to the policies and directions of the NALSA and to provide free legal services to the people and conduct LokAdalats in States. 
             The State Legal Services Authorities are chaired by Hon’ble Chief Justice of the State 
            and District and Taluka Legal Services Committees are chaired by Judicial Officer of the District or the Taluka. "
        },
        {
            "Functions of National Legal Services Authority (NALSA)
            (a) To provide free Legal Services to the eligible person,
            (b) Following persons have been identified for being eligible to avail the free Legal Aid Services:
             Women and children; 
             SC/STs; 
             Industrial Workers; 
             Victims of massive disaster/violence and natural calamities; 
             Disabled persons; 
             Persons in custody; 
             Persons whose annual income does not exceed Rs. 1,00,000/; 
             Victims of human trafficking, etc. "
        },
        {
            "Free Legal Aid and Services include
            (a) Providing of an Advocate for legal proceedings,
            (b) Payment of court fees/process fee or all other charges payable incurred in connection 
            to legal proceedings,
            (c) Preparation of Appeals/ Paper books, including printing and translation of 
            documents in legal proceedings,
             NALSA has also initiated Legal Aid Council Scheme to provide meaningful legal 
            assistance to under trial prisoners who due to lack of resources or other disabilities cannot 
            engage a council to defend them. 
             Now Legal Aid Councils have been attached to each Magistrate Court to provide 
            assistance and defend a person who is not able to engage a council right from the stage 
            he/she is produced in the court by the police. 
             The target groups are also to be informed that NALSA has also formulated a Counseling 
            and Conciliation Scheme for the settlement of disputes through negotiation and conciliation in order to guide and motivate the migrants to resolve their disputes amicably. 
             Counseling and conciliation centers are being set up in all the districts of the country. "
        },
        {
            "LEGAL LITERACY PROGRAMME 
             NALSA has formulated a strategy to
            o Provide basic and essential knowledge to the vulnerable groups so that they can understand and know the scope of their rights provided under the law, 
            o Organise Legal Aid camps for educating the weaker sections of the society., 
            o Settle their disputes though ADR mechanism, 
            o Organize meetings, seminars and workshops connected with the legal services programmes and 
            o To develop audio-visual spots, documentary films, etc. for publicity. "
        },
        {
            "LEGAL AND CLINICS 
             The rural targets groups should be informed that Legal Aid Clinics are being established 
            in all Gram PAnchayats similar to (primary Health Centres) by engaging competent 
            lawyers as legal Consultants in the Clinics. 
             A wide publicity is required to be given about these clinics with the help of Local Self 
            Government. 
             The Urban target groups are to be informed that legal aid clinincs are available in all Law 
            Collages and all Law Universities and students are encouraged to adopt remote village 
            areas for providing legal assistance to the poor and needy. 
            No fee is to be collected for te beneficiaries from the Legal Aid Clinics."
        }
    ] ,
    "penalty" : [
        {
            "PUBLIC INTEREST LITIGATION 
             Public Interest Litigation is a litigation for the protection of the public interest. 
             Article 32 of the India constitution contains a tool which directly joins the public with Judiciary. 
             A PIL may be introduced in a court of law by the court itself (suomotu), or by public spirited citizens. 
             For the exercise of the court’s jurisdiction, it is not necessary for the victim of violation rights to personally approach the court. 
             In a PIL, the right to file suit is given to a member of the public by the courts through 
            Judicial Activism. The member of the public may be Non-Governmental Organization, (NGO), an Institution or an Individual. 
             The Supreme Court of India has defended Public-Interest Litigation by stating that 
            Judiciary has stepped in to give directions because due to executive in –action, the laws 
            enacted by Parliament and the State Legislatures for the poor since independence have not been properly implemented. 
             The concept of Public Interest Litigation (PIL) is in consonance with the principles 
            enshrined in Article 39-A of the Constitution of India to protect and deliver prompt social 
            justice with the help of Law. 
             Before the 1980s. Only the aggrieved party could approach the courts for justice. After 
            the emergency era the High Court reached out to the people, devising a means for any 
            person of the public (or an NGO) to approach the court seeking legal remedy in cases where the public interest is at stake. 
             Justice P.N. Bhagwati and Justice V.R. Krishna Lyer were among the first judges to 
            admit PILS in court. 
             Filling a PIL is not as cumbersome as a usual legal case; there have been instances when 
            letters and telegrams addressed to the court have been taken up as PIL and heard. "
        }
    ]
}