{
    "article no": 04 ,
    "title": " The Indian Divorce Act",
    "date": "1869",
    "intent": "Extent of power to grant relief generally, and to make decrees of dissolution, or of nullity. - Nothing hereinafter contained shall authorise and Court to grant any relief under this Act except where the petitioner or respondent professes the Christian religion, or to make decrees of dissolution of marriage except where the parties to the marriage are domiciled in India at the time when the petition is presented, or to make decrees of nullity of marriage except where the marriage has been solemnized in India and the petitioner is resident in India at the time of presenting the petition, or to grant any relief under this Act, other than a decree of dissolution of marriage or of nullity of marriage, except where the petitioner resides in India at the time of presenting the petition",
    "rule": [
        {
            "Any husband may present a petition to the District Court or to the High Court, praying that his marriage may be dissolved on the ground that his wife has, since the solemnization thereof, been guilty of adultery. When wife may petition for dissolution -Any wife may present a petition to the District Court or to the High Court, praying that his marriage may be dissolved on the ground that, since the solemnization thereof, her husband has exchanged his profession of Christianity for the profession of some other religion, and gone through a form of marriage with another woman Or has been guilty of incestuous adultery, Or of bigamy with adultery, Or of marriage with another woman with adultery, Or of rape, sodomy or bestiality, Or of adultery coupled with such cruelty as without adultery would have entitled her to a divorce a mensa et toro,Or of adultery coupled with desertion, without reasonable excuse, for two years or upwards. Contents of petition - Every such petition shall state, as distinctly as the nature of the case permits, the facts on which the claim to have such marriage dissolved is founded. Court to be satisfied of absence of collusion - Upon any such petition for the dissolution of a marriage, the Court shall satisfy itself, so far as it reasonably can, not only as to the facts alleged, but also whether or not the petitioner has been in any manner accessory to, or conniving at, the going through of the said form of marriage, or the adultery, or has condoned the same, and shall also enquire into any countercharge which may be made against the petitioner."
        }
    ],
    "penalty": [
        {
            "Divorce rules in India clearly states that remarriage without getting divorce is a punishable offence with seven years imprisonment."
        }
    ]
}