{
    "article no" : ,
    "title": "THE PROHIBITION OF SEXUAL HARASSMENT OF WOMEN AT 
    WORKPLACE ACT", 
    "date" : "2013", 
    "intent" : "SexualHarassment at workplace broadly includes: 
    - Physical contact and advances: 
    - A demand or request for sexual favours; or 
    - Making sexually coloured remarks; or 
    - Showing pornography; or 
    - Any other unwelcome physical, verbal or non-verbal conduct of sexual nature.",
    "rule" : [
        {
            "1.1.PROCEDURAL REQUIREMENTS FOR EMPLOYERS
            1. The act provides an outline about employer’s requirements to develop a complaint mechanism. 
            2. Section 4 lays down the establishment of an Internal Complaints Committee (ICC). 
            3. The ICC must consist of atleast- 
            
                3.1 Four members under the Chairpersonship of a senior woman employee, 
                3.2 Two members from amongst the employees preferably a women with experience in social work or legal knowledge and 
                3.3 A third party member preferably affiliated with a non- governmental organization. 
            4. If a workplace has less than 10 employees it is difficult to set up ICC. In that case complaints may be filed at local complaints committee (LOC) established at the district level. 
            5. Section 19 requires employers to organize an orientation, workshops and awareness programs for sensitizing employees to the harms of sexual 
            harassment and to provide assistance to the complainant should she choose to file a police complaint. 
            6. Further, employers are required to display at the workplace details of the penal consequences of indulging in acts of sexual harassment, the composition 
            of the ICC, and the grievance redressal mechanism available to aggrieved employees. "
        },
    ]
    "penalty" : [
        {
            "THE COMPLAINT PROCESS
            1. Assuming an ICC has been established in a workplace, a woman alleging sexual 
            harassment must act quickly to preserve her complaint. 
            2. Section 9 requires that a complaint of sexual harassment be filed within three 
            months of the date of the incident. 
            3. This may be extended to another three months if the woman can prove that grave 
            circumstances prevented her from filing at an earlier time although “grave” is not 
            defined within the act. 
            4. The ICC is required to complete the inquiry within 90 days of receipt of a 
            complaint. While the complaint investigation is ongoing, upon written request of 
            the complainant, the woman may be transferred to another workplace or granted 
            leave for a period of up to three months.
            5. On completion of the inquiry, a report will be sent to the employer or the District 
            Officer (for workplaces with few than 10 employees) who is then obliged to take action on the report within 60 days. 
            6. Employers are required to ensure timely submission of reports to the District Officer. 
            7. Section 15 provides various factors to be considered if compensation for the 
            aggrieved woman is deemed appropriate by the ICC which include the level of 
            mental trauma, pain, suffering, emotional distress, medical expenses incurred, 
            financial status of the respondent, loss in career opportunity due to the incident, 
            and the feasibility of such payment in lump sum or in installments. 
            8. As a result, the accused person faces a potentially significant financial loss if found liable by the ICC. 
            9. The Act provides that the deductions may be made from the respondent’s salart or wages. 
            10. If a complaint is not proven, the ICC can instruct the employer or appropriate 
            District Officer that no further action is required. "
        }
    ]
}