{
    "article no" : ,
    "title": "MAHILA COURT", 
    "date" : "", 
    "intent" : "",
    "rule" : [
        {
            " Mahila Courts are specialized courts set up to dispense justice to women. 
             They speedily deal with and dispose off cases pertaining to women fighting legal battles 
            following matrimonial discord. 
             Mahila or Women Courts have been established as forums in which women, with or 
            without their small children, seek quick relief in disputes for shelter and for financial 
            assistance. 
             Mahila Courts are headed by experienced women judges and magistrates and the staff 
            employed in such courts is also predominantly female. They are headed by a judge of the 
            rank of Additional Chief Metropolitan cum Assistant Sessions Judge, who too, is a 
            woman. 
             These courts deal exclusively with cases pertaining to offences against women such as 
            cases relating to grant to maintenance, cases dealing with assault or criminal force and 
            words or gestures intended to insult the modesty of a woman. 
             At the Session level, Mahila Courts deal with the cases of Kidnapping, procuring minor 
            girls for the purpose of prostitution, rape and cruelty by husband or in-laws. 
             The Metropolitan Magistrate in these courts are assigned cases relating to molestation, 
            rape, kidnapping and also of Domestic Violence. 
             These courts serve the purpose of rendering justice in criminal matters pertaining to 
            women victims with great sensitivity. 
             The procedure followed in these courts is informal and comfortable for women. They can 
            shed their inhibitions and depose freely in the presence of women judges, who are more 
            sensitized towards females and their inherit nature. 
             These courts also provide a platform to women where they can negotiate their claims. 
            Mahila Courts ordinarily hold criminal trials but at times conciliation proceedings are 
            also organized in order to preserve the family fabric. "
        }
    ] ,
    "penalty" : [
        {

        }
    ]
}