{
    "article no": 53,
    "title": " ATERNITY BENEFIT ACT, 1961 with was amended in 2017 which several major changes.",
    "date": "1961",
    "intent":" The law applies-
    (a) to factory, mine or plantation including such establishments belonging to the government or an establishment requiring physical labor, skills or performances.
    (b) shops or establishments where more than 10 people are employed or were employed on any day in the preceding twelve months. The state government, with the approval of the central government, after giving a notice of at least two months decides that the provisions of the act may apply to any other establishment.",
    "rule": [
        {
    "1. No woman will be asked to work in an employment for six weeks immediately preceding her delivery or miscarriage.
    
    2. Every woman will be entitled to the maternity benefits in terms of wages as prescribed in the act.
    
    3. A woman shall only be entitled to the maternity benefits under this act only if she has worked for the employer for a period of not less than one hundred and sixty days in the twelve months immediately preceding the date of her expected delivery.
    
    4. The maximum number of leaves that a woman is entitled to under the act is 12 weeks.
    
    5. A woman will not be allowed to do such work that can harm her or her child's health during pregnancy.
    
    6. The law provides same benefits to women who have a miscarriage or tubectomy.
    
    7. A woman suffering from illness arising out of pregnancy, delivery, premature birth of child (Miscarriage, medical termination of pregnancy or tubectomy operation) be entitled, in addition to the period of absence allowed to her leave with wages at the rate of maternity benefit for a maximum period of one month."
        }
    ],
    "penalty": [
        {
            "Under section 21 of the Maternity Act, an employer for contraventions of the Act may be imprisonment for a period which shall not be less than 3 months and which may extend to an year with fine of a sum of RS. not less than 2000 and which may even be extended to the thousands."
        }
    ]
}