{
    "article no" : ,
    "title": "MINIMUM WAGES ACT", 
    "date" : "1948", 
    "intent" : "
         Women must get wages because every person who works must be paid for his or her work. 
         A person must be paid at least a minimum wages which is fixed by the government under the Minimum Wages Act, 1948. 
         Every woman must be paid the same wage as a man for the same kind of work i.e., equal to the man and not less. 
         Women workers must be given to the person who work on temporary basis, piece rate 
        basis, daily wages, who works for a contractor or who works in agriculture. 
         Even if a person agrees to work on less wages then prescribed by the government, the employer is bound to pay the minimum wages. 
         Minimum wages must be fixed on: 
             Daily basis, 
             Hourly basis and 
             Monthly basis. ",
    "rule" : [
        {
            "REMEDY/PROCEDURE UNDER THE MINIMUM WAGES ACT, 1948
             If the employer is not paying the Minimum Wages then the labour can complaint 
            to the labour inspector. 
             The employer cannot make the labour work for more than 9 hours which includes 
            the time for rest also. 
             If the labour works for more than 9 hours he/she will get the extra money which is 
            doubled the wages. 
             Every day there should be one day paid rest. 
             Claims for payment of minimum rates of wages or remuneration for days of rest 
            or wages at overtime rate or as per the rules and orders made by the appropriate 
            government under this Act. 
             The Presiding Officers of the Labour court and Deputy Labour Commissioners 
            hear and decide claims arising out of payment of less than the minimum rates of 
            wages. The employee or any legal practitioner or any official of a regd. Trade 
            Union or any Inspector or Any other authorized person may file a claim petition 
            under this act."
        }
        
    ] ,
    "penalty" : [
        {
            "How to file the Complaint? 
             Every application under this Act must be presented within 6 months from the date 
            on which the minimum wages become payable. 
             A single application may be filed on behalf of any number of employees. 
             The Adjudicating authority will hear both the applicant and the employer and 
            after due inquiries may direct
                    i. Payment of the difference between the minimum wages to be paid under 
                    the Act and the actual wages along with a compensation not exceeding 10 times such amount. 
                    ii. Payment of any amount due to the employees by the employer along with 
                    compensation. A Penalty of fifty rupees may be levied on the applicant if 
                    the authority feels that the application is either malicious or vexatious. The 
                    direction of the authority is final and he shall exercise all the powers of a 
                    civil court under the Code of Civil Procedure for taking evidence, 
                    enforcing attendance of witnesses and compelling the production of 
                    documents. Courts have been barred from entertaining suits under this Act. 
             No appeal shall lie against the decision of the authorities under the Act."
        }
    ]
}