{
    "article no" : ,
    "title": " ", 
    "date" : "", 
    "intent" : "",
    "rule" : [
        {
            "The National Commission for Women was set up as statutory body in January 1992 under the 
            National Commission for Women Act, 1990 with a mandate to safeguard the constitutional rights 
            of women. It is concerned with advising the government on all policy matters affecting women.
            The objective of the NCW is to represent the rights of women in India and to provide a voice for their issues and concerns.
             The functions of the Commission are as follows: 
             Investigate and examine all matters relating to the safeguards provided for women under 
            the Constitution and other laws; 
             Present to the Central Government, annually and at such other times as the commission may deem fit, reports upon the working of those safeguard; 
             Make in such reports, recommendations for the effective implementation of those safeguards for improving the conditions of women by the Union or any State; 
             Review, from time to time , the existing provisions of the Constitution and other laws 
            affecting women and recommend amendments thereto so as to suggest remedial 
            legislative measures to meet any lacunae, inadequate or shortcomings in such legislation; 
             Take up the case of violation of the provisions of the Constitution and the other laws relating to women with the appropriate authorities;
             Look into complaints and take suo moto notice of matters relating to – 
            a) Deprivation of women’s rights; 
            b) Non-implementation of laws enacted to provide protection to women and also to achieve the objective of equality and development; 
            c) Non-compliance of policy decisions, guidelines or instructions aimed at mitigating 
            hardships and ensuring welfare and providing relief to women, and take up the issues arising out of such matters with appropriate authorities. 
             Call for special studies or investigations into specific problems or situations arising out of 
            discrimination and atrocities against women and identify the constraints so as to recommend strategies for their removal; 
             Undertake promotional and educational research so as to suggest ways of ensuring due 
            representation of women in all spheres and identify factors responsible for impeding their 
            advancement such as lack of access to impeding their advancement such as lack of access 
            to housing and basic services, inadequate support services and technologies for reducing 
            drudgery and occupational health hazards and for increasing their productivity; 
             Participate and advise on the planning process of socio-economic development of women; 
             Evaluate the progress of the development of women under the Union and State; 
             Inspect or cause to be inspected jail, remand home, women’s institution or other place of 
            custody where women are kept as prisoners or otherwise, and take up with the concerned 
            authorities for remedial action, if found necessary; 
             Found litigation involving issues affecting a large body of women. 
            Similarly at the state level also Commission for Women exist with the same objectives 
            and functions. The Resource Person must appraise the target groups about the procedure to approach the Commission."
        }
    ] ,
    "penalty" : [
        {

        }
    ]
}