{
    "article no": 06,
    "title": " THE PROHIBITION OF CHILD MARRIAGE ACT 2006",
    "date": "2006",
    "intent":"The objective of this Act is to prohibit solemnization of marriage where either the groom or the bride is below the marriageable age (18 years in case of girls and 21 years for boys). To ensure that child marriage is eradicated from the society, the Government of India enacted Prevention of Child Marriage Act 2006 by replacing the earlier legislation of Child Marriage Restraint Act, 1929. This new Act is armed with enabling provisions to prohibit child marriage, protect and provide relief to victim and enhance punishment for those who abet, promote or solemnize such marriage. 
    Definitions-
    Child: A child is a person who has not completed 21 years in case of male and 18 years in case of female. 
    Contracting party: Either of the parties whose marriage is or is about to be solemnized. 
    Child marriage: A marriage in which either party is a child. 
    Minor: A person who is not deemed to be major under Majority Act. 
    Voidable marriage: (Section 3) Every child marriage is voidable at the option of the contracting party who was child at the time of solemnization of marriage. A decree of nullity can be obtained by such person by filing petition before the District court for annulment of marriage within 2 years after attaining majority. While granting a decree, the district court shall make an order directing both parties and their parents or guardians to return to the other party, money, gold, ornaments, gifts and other valuables",
    "rule": [
        {
    "To whom and where complaint can be made regarding child marriage: 
    Call 1098, 1090 or 100 
    Complaint can be directly made to Child Marriage Prohibition Officer 
    The nearest police station 
    To District Magistrate
    When marriage is null and void: 
    Where minor child is taken or enticed out of the keeping of legal guardian 
    By force compelled or by any deceitful means induced to go from any place 
    Is sold for purpose of marriage and go through a form of marriage or 
    If the minor is married after which the minor is sold off or trafficked or used for immoral purpose"
        }
    ],
    "penalty": [
        {
     "Punishment for male adult: If an adult male who is above 18 years of age contracts child marriage, he shall be punishable with rigorous imprisonment for two years or with fine which may extend to one lakh rupees or both. 
    Punishment for solemnizing marriage: If a person performs, conducts, directs or abets any child marriage, he shall be punishable with rigorous imprisonment for two years or with fine which may extend to one lakh rupees or both. 
     Punishment for promoting / permitting solemnization of marriage: Any person having charge of the child whether parent or guardian or any other person including member of organization or association of persons who does any act to promote the child marriage or permit child marriage or negligently fails to prevent it from being solemnized, including attending or participating such marriage, shall be punishable with rigorous imprisonment for upto two years or with fine which may extend to one lakh rupees or both."
        }
    ]
}