{
    "article no" : ,
    "title": " THE EQUAL REMUNERATION ACT", 
    "date" : "1976", 
    "intent" : "- Parity in wages is one of the major components of Service Law Jurisprudence which has 
    evolved over the years.
    - If two workers are doing the same work, they should be paid equal wages. ",
    "rule" : [
        {
            "- Even Article 39 of the Constitution envisages that the state shall direct its policy, among 
            other things, towards securing that there is equal pay for equal work for both men and women. 
            - To give effect to this Constitutional provision The Equal Remuneration Act, 1976 was 
            passed to provide for the payment of equal remuneration to men and women workers and 
            for the prevention of discrimination, on the grounds of sex, against women in the matter of employment. 
             People’s Union for Democratic Rights v. union of India
             Duty of Employer to pay equal remuneration to men and women workers for same work or work of a similar nature.
             No employer shall pay to any worker, at rates less favourable than those at 
            which remuneration is paid by him to the workers of the opposite sex for the same work or work of a similar nature.
             An employer cannot claim exemption on the grounds of financial 
            incapability from The Equal Remuneration Act, 1976.
             No discrimination to be made while recruiting men and women workers. 
                 No employer shall, while making recruitment of the same work or 
                work of a similar nature, or in recruitment such as promotions, training 
                or transfer, make any discrimination against women in such work is 
                prohibited or restricted by or under any law for the time being in force. 
                 The provisions of this section shall not affect any priority or 
                reservation for scheduled castes or scheduled tribes, ex-servicemen, 
                retrenched employees of any other class or category of persons in the 
                matter of recruitment to the posts in an establishment or employment."
        },
        {
            " Advisory committee:
                - The appropriate government shall constitute one or more advisory 
                committees to advice. 
                - Every advisory committee shall consist of not less than ten persons of 
                which one-half shall be women. 
                - The advisory committee shall have regard to the number of women 
                employed in the concerned establishment or employment, the nature of 
                work, hours of work, suitability of women for employment. 
                - The advisory committee shall regulate its own procedure. 
             Power of appropriate government to appoint authorities for hearing and deciding claims and complaints: 
                - A labour officer is to be appointed for the purpose of hearing and 
                deciding; 
                - Complaints with regard to the contravention of any provision of this Act, 
                - Claims arising out of non- payment of wages at equal rates to men and 
                women and
                - In the case of complaint, that adequate steps to be taken by the 
                employer so as to ensure that there is no contravention of any provision of this Act. 
                - Every authority appointed shall have all the powers of a civil code 
                under the Code of Civil Procedure, 1908 (5 of 1908), for the purpose 
                of taking evidence and of enforcing the attendance of witnesses and compelling the production of documents. 
                - An appeal within 30 days but not thereafter is allowed. 
                - It is the duty of employers to maintain the registers. "
        },
        {
           "  Powers of Inspectors: 
            - To enter, at any reasonable time with such assistance as he thinks fit, 
            any building, factory, premises or vessel; 
            - To require any employer to produce any register, muster- roll or other 
            documents relating to the employment of workers, and examine such 
            documents; 
            - To the provisions of this Act are being, or have been, complied with; 
            - To examine the employer, his agents or servant or any other person 
            found in charge of the establishment or any premises connected 
            therewith; 
            - To make copies, or take extracts from, any register or other document 
            maintained in relation to the establishment under this Act. "
        },
        {
            " Remedies under the Act: 
            - A complaint may be made to the appropriate authority appointed by 
            the government by
            o The worker or 
            o A legal practitioner or 
            o Any official of a registered trade union authorized for this purpose or 
            o An inspector appointed under section 9 of the Act. 
            - A Metropolitan Magistrate or a Judicial Magistrate of the first class is 
            eligible to try offences under the Act. The Magistrate may take up the 
            case on its own or on receiving a complaint either from-
            o The appropriate Government or 
            o The aggrieved person or 
            o Any recognized Welfare Institution or Organization and even Public 
            Interest Litigation may be filed for discrimination in payment on 
            grounds of gender. "
        }
    ] ,
    "penalty" : [
        {
            " How to file a Complaint?
            The complaint to the authority appointed under the Act must be made in Triplicate, in Form A 
            for contravention of the Provisions of the Act and in form b for nonpayment of equal wages. The 
            Authority will listen to both the parties and after making the necessary inquiry, direct the 
            payment of the difference in the amount actually paid and the amount payable under the Act or 
            direct the employer to comply with the provisions of the Act. 
            - Either of the parties may appeal to the appellate authority as notified 
            by the Government under the Act within 30 days of the original order. 
            - Alternatively, a Public Interest Litigation may be filed in the court of 
            law or the Legal Services Authority may be approached for getting 
            appropriate relief and legal aid. "
        }
    ]
}