{
    "article no" : "42",
    "title": "THE MATERNITY BENEFIT ACT", 
    "date" : "1961", 
    "intent" : "
     Motherhood is a very special experience in a woman’s life. A woman needs to be 
    able to give a quality time to her child without having to worry about her job and her source of income.
     Article 42 of the Constitution of India imposes obligation upon the state to make 
    provisions for securing just and human conditions of work and for maternity relief.
     The maternity benefit is a payment to a woman worker at the rate of average daily 
    wages for the period of her actual absence immediately preceding and including 
    the day of her delivery and for six weeks immediately following that day.
     In the matters relating to maternity leave, economic benefits during absence of 
    work, leave for bringing up children and non- termination of service during 
    pregnancy and immediately after delivery were deliberated upon and a resolution passed",
    "rule" : [
        {
            "In the sixth session of International labor organization held in 1975, emphasis was 
            laid down on the need to make maternity protections more adequate in the following spheres: 
             Extension of maternity protection to new categories of women workers, 
             Extension of the period of statutory or prescribed maternity leave, 
             More liberal provisions for extended or extra leave during child’s infancy, 
             Higher rates of maternity benefits, 
             More effective protection against dismissal during pregnancy and after confinement, 
             Greater encouragement of breastfeeding and wider provisions of nursing breaks, 
             More adequate attention to the safety and health of woman during, pregnancy and 
             Establishment by social security schemes or public bodies of day nurseries 
            to care for infants and children of working parents. "
        },
        {
            "Maternity Benefits: A woman can get maternity Benefits,
                o During Pregnancy 
                o After Pregnancy (during the early months of motherhood) 
             Government employed women are entitled for maternity leave with full pay. 
             Other working women are entitled for 16 weeks maternity benefits. 
             Even unmarried women are entitled for maternity benefits. 
             Only those Government employees can avail these benefits, which have less than two surviving children. 
             If a woman wants she can avail few days before the delivery and the 
            remaining leave after the delivery, or she can avail the entire leave at the same time. 
             The employer cannot make a woman do any heavy work in the last 
            working month of pregnancy. She can refuse to do work which is 
            physically tiring and involved long standing hours, caring heavy loads or 
            any work which can endanger the proper growth of child, etc. 
             A woman is entitled to 45 days leave full wages in case of miscarriage
            The National maternity Benefit scheme was modified and new scheme called 
            Janani SrakshaYojna was introduced. "
            
        },
    ] ,
    "penalty" : [
        {
            " Complaint: Section 17- Section 17 talks of complaint that can be made to 
            the inspector appointed under the Act. Section 23 talks of complaint that may 
            be lodged in a court of law after exhausting the remedies provided under the 
            Act. "
        },
        {
            "PROCEDURE TO SEEK REMEDY-
             Normally, for any grievance under the Act, the aggrieved woman may 
            approach the Inspector appointed under the Act. 
             However, where she is dissatisfied with the orders passed by the Inspector 
            or where a larger question of law is involved she may approach the 
            Metropolitan Magistrate or a first class Judicial Magistrate of the 
            competent jurisdiction. However, such a case must be filed within 1 year 
            from the date of commission of offence. 
             Any office bearer of a registered Trade Union of which such a woman is a 
            member or a Voluntary Organization registered under the Societies 
            Registration Act, 1860 or any inspector may also file a case in a court of 
            law on behalf of the aggrieved woman. 
             In some cases, the inspector may enter any place where women are 
            working, in exercise of powers given to him under the Act and examine 
            any registers, records or notices required to be maintained under the Act. 
             He may examine any employee of the establishment and require them to 
            give him information regarding particulars of employees, payments made 
            and application or notice received from them. If he finds any discrepancies 
            in the matter or payment of maternity benefits, he may direct such payments to be made. 
             The woman should have put 80 days of work before in a delivery period of 
            one year to be able to claim the benefits under the Act. 
             It is the duty of woman claiming maternity benefit to give notice in 
            writing in the prescribed form to her employer claiming her benefit and 
            the period of leave. Such a notice may be given immediately after delivery also.
             Where she has failed to give such a notice, she may apply to the Inspector 
            who shall make the necessary orders of payment under the Act. 
             Appeal against the orders of the Inspector lies to the appellate authority 
            which must be made within 30 days from the date of the decision of the 
            Inspector is communicated to her. The decision of the appellate authority is final. 
             If she is dissatisfied with the orders of the Inspector or the appellate 
            authority or if a larger Question of law is involved, she may approach the 
            court of the competent jurisdiction. The case will proceed according to the 
            established procedure of law. 
             Where the employer is guilty of payment of maternity benefit or 
            dismissing or discharging the employee on account of her absence in 
            violation of the Act, he is punishable with imprisonment not less than 3 
            months to one year and with fine for not less than Rs. 2000 to Rs. 5000 
             There is appeal against the decision of the inspector. In a court of law, the 
            normal procedure of filing appeals may be followed.
             Alternative Remedies-/ Judicial; The Act itself has provided for an 
            alternative judicial recourse by appointing Inspectors under the Act and 
            for an appellant authority above him. 
             Only where the complainant is dissatisfied with their decisions that she 
            has to approach a court of law for judicial remedies and for instituting 
            penal action against her employer. Certain questions of law like the period 
            to be included while calculating the amount of maternity benefit etc. are 
            also decided by a court of law. 
             The aggrieved woman may also approach the registered trade union of 
            which she is a member or a voluntarily social organization that may help 
            fight her case. "
        }
    ]
}