{
    "article no" : ,
    "title": " ", 
    "date" : "1948", 
    "intent" : "- In India, The Factories Act, 1881 was primarily passed to protect children and to provide 
    for a few measures for the health and safety of workers.
    - The subsequent act and finally the Act of 1948 aim to consolidate and amend the law and regulate labour in factories.
    - This Act is complete from all points of view and implements several provisions of 
    International Conventions like the ILO’S code of Industrial Hygiene and Periodical 
    Examination of Young Persons. "
    "rule" : [
        {
            " The major objectives of the Factories Act are- 
             To protect laborers from long hours of work. 
             Maintain healthy and sanitary conditions at the workplace. 
             Maintain safety of workers. 
             Maintain Industrial machines used by people so as to avoid unnecessary accidents. 
             Regular visit of Industrial sites by Industrial Inspectors to oversee health and safety regulations. 
             Executive provisions have been made for employment of women in factories. 
             Welfare 
             Adequate facilities for washing, sitting, storing clothes when not worn during working hours. 
             If a worker has to work in standing position, sitting arrangement to take short rests 
            should be provided. 
             Adequate First aid boxes should be provided and maintained. "
        },
        {
            "- Facilities in case of large factories: Crèches are to be provided if 30 or more women workers are employed. 
            - Safety measures. 
            - Working hours. 
            - Overtime wages: 
             Overtime wages are double the rate of wages payable. 
             Overtime should not exceed 60 hours in a week and total overtime hours in a quarter 
            should not exceed 50. Register of overtime should be maintaine"
        },
        {
            "RIGHTS OF WORKING WOMEN IN FACTORIES 
             Women must have separate toilets and washrooms with doors. 
             If a factory has more than 30 women workers the employer must provide a crèche for the 
            workers children. 
             Women cannot be made to lift more than the prescribed weight. 
             Women cannot be made to clean or oil any moving machine. 
             Women cannot be made to work more than 48 hours in a week. 
             Women must get one day off in a week. 
             Women cannot be made to work for more than 5 hours at a stretch. 
             Women cannot be made to work only between 6 in the morning and 7 in the evening. 
             State government can grant exemption to nay factory or group or class of factories, but no 
            woman can be permitted to work during 10 PM to 5 AM. 
             Shift can change only after weekly or other holiday and not in between. 
             Night shift for womeno Factories Act has been proposed to be amended to allow night shift for women 
            workers. 
                o The government has decided to amend section 66 of the Factories Act, 1948 to 
                allow employment of women workers between 7:00 pm and 6:00am. 
                o The employer has to ensure occupational safety and adequate protection to the 
                women workers.
                o For contravention of the provisions of the Act or Rules- imprisonment up to 2 
                years or fine up to Rs. 1,00,000 or both. 
                o Contravention causing death or serious bodily injury- fine not less than Rs. 25,000 
                in case of death and not less than Rs. 5000 in case of serious injuries. 
                o Continuation of Contravention – imprisonment up to 3 years or fine not less than 
                Rs. 10,000 which may extend to Rs. 2, 00,000. 
                o On contravention of chapter IV pertaining to safety or dangerous operation. 
                o Factories Act works with a primary object to protect workers employed in the 
                factories against industrial and occupational hazards. 
                o For that purpose, it seeks to impose upon the owners or the occupiers certain 
                obligations to protect works unwary as well as negligent and to secure for them, 
                employment in conditions conductive to their health and safety from accidents. 
            "
        }
    ] ,
    "penalty" : [
        {

        }
    ]
}