{
    "artical no" : 28,
    "title": "THE DOWRY PROHIBITION ACT, 1961",
    "date" : "01-05-1961", 
    "intent" : "Intended to prevent the giving or receiving of a dowry." ,
    "rule" : [ {"Dowry Prohibition Act, Indian law, enacted on May 1, 1961, intended to prevent the giving or receiving of a dowry. Under the Dowry Prohibition Act, dowry includes property, goods, or money given by either party to the marriage, by the parents of either party, or by anyone else in connection with the marriage. The Dowry Prohibition Act applies to persons of all religions in India. "}
    , {"The original text of the Dowry Prohibition Act was widely judged to be ineffective in curbing the practice of dowry. Moreover, specific forms of violence against women continued to be linked to a failure to meet dowry demands. As a result, the legislation underwent subsequent amendment. In 1984, for example, it was changed to specify that presents given to a bride or a groom at the time of a wedding are allowed. The law required, however, that a list be maintained describing each gift, its value, the identity of the person giving it, and the person’s relation to either party to the marriage. The act and relevant sections of the Indian Penal Code were further amended to protect female victims of dowry-related violence. Another layer of legal protection was provided in 2005 under the Protection of Women from Domestic Violence Act. "} ],
    "penality" : [ ["Amendments to the original Dowry Prohibition Act also established minimum and maximum punishments for giving and receiving dowry and created a penalty for demanding dowry or advertising offers of money or property in connection with a marriage. The Indian Penal Code was also modified in 1983 to establish specific crimes of dowry-related cruelty, dowry death, and abetment of suicide. These enactments punished violence against women by their husbands or their relatives when proof of dowry demands or dowry harassment could be shown."] ,
     [0,{}],
     [1,{}], 
     [2,{}], 
     [3,{}] 
    ],
    "" :""
}