{
    "article no" : ,
    "title": "THE PROTECTION OF CHILDREN FROM SEXUAL OFFENCES (POCSO) 
    ACT, 2012", 
    "date" : "2012", 
    "intent" : "",
    "rule" : [
        {
            "- The Act was enacted to provide a robust legal framework for the protection of children from offences of sexual assault, sexual harassment and pornography, while safeguarding the interest of the child at every stage of the judicial process. 
            The framing of the Act seeks to put children first by making it easy to use by including mechanisms for childfriendly reporting, recording of evidence, investigation and speedy trial of offences through designated Special Courts. 
            The Act makes abetment of child sexual abuse an offence. "
        },
        {
            "- Offences under the act include: 
            i. Penetrative Sexual Assault: Insertion of penis/object/another body part in child's vagina/urethra/anus/mouth, or asking the child to do so with them or some other person  
            ii. Sexual Assault: When a person touches the child, or makes the child touch them or someone else 
            iii. Sexual Harassment: passing sexually coloured remark, sexual gesture/noise, repeatedly following, flashing, etc. 
            iv. Child Pornography: With respect to pornography, the Act criminalizes even watching or collection of pornographic content involving children. 
            v. Aggravated Penetrative Sexual Assault/ Aggravated Sexual Assault"
        },
        {
            "Gender Neutral Law: The Act is gender-neutral"
        },
        {
            "Child-friendly process: It also provides for various procedural reforms, making the process of trial considerably easier for children."
        },
        {
            "Child Welfare Committee (CWC): 
            Police officer is duty bound to inform the CWC about every case under the Act within 24 hours. 
            CWC can appoint a support person for the child who will be responsible for psychosocial well being of the child. 
            This support person will also liaise with the police, and keep the child and child's family informed about progress in the case. "
        }
    ] ,
    "penalty" : [
        {
            "PROCEDURE FOR REMEDY
            - Anyone including a child (anyone below 18 years of age) can report an offence to Special Juvenile Police Unit/Local police."
        }
    ]
}