{
    "article no" : ,
    "title": "FEMALE INFANTICIDE AND FOTICIDE", 
    "date" : "", 
    "intent" : " Female infanticide is the intentional killing of infant girls. 
     Destroying foetus in the womb, because she is likely to be born as a girl child, is female foeticide.",
    "rule" : [
        {
            " 
             All involved in female foeticide deliberately forget to realize that when the foetus of a 
            girl is destroyed, a woman of future is crucified. To put it differently, the present present 
            generation invites the sufferings on its own and also sows the seeds of suffering for the future generation, as in the ultimate eventuate, the sex ratio gets affected and leads to 
            manifold social problems. 
             It is not out of place to state here that the restricted and constructed thinking with regard 
            to a girl child eventually leads to a female foeticide. 
             In addition to the active methods undertaken to eliminate baby girls soon after birth, 
            neglect and discrimination leading to death and sex-selective abortion are also means by 
            which many female children die each year. 
             Ultra sound and scanning, being a non-invasive technique, quickly gained popularity and 
            are now available in some of the most remote rural areas. These techniques are now being 
            used for sex determination with the intention of abortion if the foetus turns out to be 
            female. "
        },
        {
            " Prohibition of sex-selectionNo person, including a specialist or a team of specialists in the field of infertility, shall 
            conduct or aid in conducting sex selection of a woman or a man or both or on any tissue, 
            embryo, coneptus, fluid or gametes derived from either or both of them. 
             Prohibition on sale of ultrasound machines, etc., to persons, laboratories, clinics, 
            etc. not registered-
             No person shall sell any ultrasound machine or imaging machine or 
            scanner or any other equipment capable of detecting sex of the foetus to 
            any Genetic Counseling Centre, Genetic laboratory, Genetic Clinic or any 
            other person not registered under the Act 
             No pre-natal diagnostic techniques shall be conducted except for the 
            purposes of detection of any of the following abnormalities, viz., 
            chromosomal abnormalities, genetic metabolic diseases, 
            haemoglobinopathies, sex-linked genetic diseases, congenital anomalies, 
            etc. 
             No pre-natal diagnostic techniques shall be conducted unless the person 
            qualified to do so is satisfied for reasons like- 
             Age of the pregnant woman is above thirty-five years,
             The pregnant woman has undergone two or more spontaneous abortions of 
            foetal loss
             The pregnant woman had been exposed to potentially teratogenic agents 
            such as drugs, radiation, infection or chemicals,
             The pregnant woman or her spouse has a family history of mental 
            retardation or physical incapability,
             Deformities such as, spasticity or any other genetic disease and
             Any other condition as may be specified by the Central supervisory Board."
        }
    ] ,
    "penalty" : [
        {
            "PROCEDURE FOR REMEDY
            o If any doctor or specialist conducts sex selection he will be punished 
            with an imprisonment of 5 years and fine of Rs.10,000/ or removal of 
            his name from register of medical council.
            o Publication, distribution or communication of any advertisement is illegal.
            o A pregnant women cannot be compelled by anyone to get the sex of 
            the foetus determined and those who compel her to do so will be 
            punished with 3 years’ imprisonment and a fine of Rs.10,000"
        }
    ]
}