{
    "article no" : ,
    "title": "THE MEDICAL TERMINATION OF PREGNANCY ACT", 
    "date" : "1971", 
    "intent" : "WOMEN AND THE REPRODUCTIVE HEALTH RIGHTS ABORTION OR 
    TERMINATION OF PREGNANCY 
     Relevant Provisions of The Indian Penal Code, 1860-
     Section 312: Causing miscarriage 
     Section 313: Causing miscarriage without woman’s consent. 
    (Whoever causes miscarriage of a woman without her consent shall be punished with ten 
    years imprisonment and fine) 
    However, there are certain situations in which it is legal to terminate the pregnancy on 
    the advice of doctor if: 
     To continue pregnancy involves the risk to the mother’s life (physical or mental); 
    or 
     The pregnancy is caused by rape; or 
     The child is born it would be gravely deformed. ",
    "rule" : [
        {
            " This Act provides for the termination of certain pregnancies by registered medical practitioners and for matters connected there with or incidental thereto.
             Forcing a woman to terminate pregnancy is illegal.
             Abortion is legal when it is done according to the law. 
             Abortion carried on by midwives, nurses or quacks is illegal. 
             It should be done only in Government Hospital or in a hospital authorized by the Government. 
             When pregnancies may be terminated by registered medical practitioners. 
             A registered medical practitioner shall not be guilty of any offence if any pregnancy is 
            terminated by him in accordance with the provisions of this Act. 
             A pregnancy may be terminated by a registered medical practitioner- 
                 Where the length of the pregnancy does not exceed twelve weeks; or 
                 Where the length of the pregnancy exceeds twelve weeks but does not exceed 
                twemty weeks and is done in good faith; or 
                 In case where the continuance of the pregnancy would a risk to the life of the 
                pregnant woman or of grave injury whether physical or mental; or 
                 Where there is a substantial risk that if the child was born, it would suffer from 
                such physical or mental abnormalities as to be seriously handicapped. 
                 Where any pregnancy is alleged by the pregnant woman to have been caused by 
                rape (the anguish caused by such pregnancy shall be presumed to constitute a 
                grave injury to the mental health of the pregnant woman.) 
                 Where any pregnancy occurs as a result of failure of any device or method for the 
                purpose of limiting the number of children (the anguish caused by such unwanted 
                pregnancy may be presumed to constitute a grave injury to the mental health of 
                the pregnant woman.) 
             No pregnancy of a woman, who has not attained the age of eighteen years, or, who, 
            having attained the age of 18 years, is a lunatic, shall be terminated except for the case in 
            which her guardian gives his/her consent in writing."
        }
    ] ,
    "penalty" : [
        {

        }
    ]
}