{
    "article no" : 366,
    "title": "TRAFFICKING OF WOMAN", 
    "date" : "", 
    "intent" : "",
    "rule" : [
        {
"            - Trafficking in women and children includes placing them in conditions of forced labour and forced sex. 
            - The recruiters and traffickers who force a women and child into sexually or economically 
                oppressive and exploitative situation as well as other illegal activities such as false marriages, 
                false adoption, domestic labour and all kinds of illegal employment. 
            - Section 366-A, IPC: Procreation of minor girl- Whoever, by any means whatsoever, induces any minor girl under the age of eighteen years to go from any place or to do any 
                act with intent that such girl may be, or knowing that it is likely that she will be, forced or 
                seduced to illicit intercourse with another person shall be punishable with imprisonment which may extend to ten years, and shall also be liable to fine. "
        }
    ] ,
    "penalty" : [
        {
             "THE IMMORAL TRAFFIC (PREVENTION) ACT, 1956 :
         - Trafficking of the women generally starts on the promise of job or marriage by which recruiters entice e the victims to leave home. 
         - Further, the village girls and their families are often deceived by the agents"   
        },
        {
            " PROCEDURE FOR REMEDY
            o) The first thing that the victim has to do is to file an FIR in the nearest police station. 
            The complainant of sexual assault has a right to be represented by a lawyer from the beginning of the case, from lodging of an F.I.R. at police station till the final outcome of the case. 
            o) If the officer in- charge of the police station refuses to register F.I.R., then the victim can meet or send a copy of the complaint in writing to the deputy commissioner of police or the Superintendent of Police. 
            If action is still not taken, then she can file the complaint before the magistrate within whose jurisdiction the police station falls. 
            The doctor should cater the medical needs of victim with utmost priority. 
            No hospital can deny conducting medical legal checkup (M.L.C.) of the victim who has come to hospital without police referral. "
        }
    ]
}